grevaillot/svd_tools/headers/STM32H7A3x/hsem.h
#pragma once 

/* --- HSEM: HSEM --------------------------------------------------- */

/** @defgroup hsem_registers HSEM Register
@{*/

/** HSEM_R0 HSEM register HSEM_R0 HSEM_R31 **/
#define HSEM_R0			MMIO32(HSEM_BASE + 0x00)
/** HSEM_R1 HSEM register HSEM_R0 HSEM_R31 **/
#define HSEM_R1			MMIO32(HSEM_BASE + 0x04)
/** HSEM_R2 HSEM register HSEM_R0 HSEM_R31 **/
#define HSEM_R2			MMIO32(HSEM_BASE + 0x08)
/** HSEM_R3 HSEM register HSEM_R0 HSEM_R31 **/
#define HSEM_R3			MMIO32(HSEM_BASE + 0x0c)
/** HSEM_R4 HSEM register HSEM_R0 HSEM_R31 **/
#define HSEM_R4			MMIO32(HSEM_BASE + 0x10)
/** HSEM_R5 HSEM register HSEM_R0 HSEM_R31 **/
#define HSEM_R5			MMIO32(HSEM_BASE + 0x14)
/** HSEM_R6 HSEM register HSEM_R0 HSEM_R31 **/
#define HSEM_R6			MMIO32(HSEM_BASE + 0x18)
/** HSEM_R7 HSEM register HSEM_R0 HSEM_R31 **/
#define HSEM_R7			MMIO32(HSEM_BASE + 0x1c)
/** HSEM_R8 HSEM register HSEM_R0 HSEM_R31 **/
#define HSEM_R8			MMIO32(HSEM_BASE + 0x20)
/** HSEM_R9 HSEM register HSEM_R0 HSEM_R31 **/
#define HSEM_R9			MMIO32(HSEM_BASE + 0x24)
/** HSEM_R10 HSEM register HSEM_R0 HSEM_R31 **/
#define HSEM_R10			MMIO32(HSEM_BASE + 0x28)
/** HSEM_R11 HSEM register HSEM_R0 HSEM_R31 **/
#define HSEM_R11			MMIO32(HSEM_BASE + 0x2c)
/** HSEM_R12 HSEM register HSEM_R0 HSEM_R31 **/
#define HSEM_R12			MMIO32(HSEM_BASE + 0x30)
/** HSEM_R13 HSEM register HSEM_R0 HSEM_R31 **/
#define HSEM_R13			MMIO32(HSEM_BASE + 0x34)
/** HSEM_R14 HSEM register HSEM_R0 HSEM_R31 **/
#define HSEM_R14			MMIO32(HSEM_BASE + 0x38)
/** HSEM_R15 HSEM register HSEM_R0 HSEM_R31 **/
#define HSEM_R15			MMIO32(HSEM_BASE + 0x3c)
/** HSEM_R16 HSEM register HSEM_R0 HSEM_R31 **/
#define HSEM_R16			MMIO32(HSEM_BASE + 0x40)
/** HSEM_R17 HSEM register HSEM_R0 HSEM_R31 **/
#define HSEM_R17			MMIO32(HSEM_BASE + 0x44)
/** HSEM_R18 HSEM register HSEM_R0 HSEM_R31 **/
#define HSEM_R18			MMIO32(HSEM_BASE + 0x48)
/** HSEM_R19 HSEM register HSEM_R0 HSEM_R31 **/
#define HSEM_R19			MMIO32(HSEM_BASE + 0x4c)
/** HSEM_R20 HSEM register HSEM_R0 HSEM_R31 **/
#define HSEM_R20			MMIO32(HSEM_BASE + 0x50)
/** HSEM_R21 HSEM register HSEM_R0 HSEM_R31 **/
#define HSEM_R21			MMIO32(HSEM_BASE + 0x54)
/** HSEM_R22 HSEM register HSEM_R0 HSEM_R31 **/
#define HSEM_R22			MMIO32(HSEM_BASE + 0x58)
/** HSEM_R23 HSEM register HSEM_R0 HSEM_R31 **/
#define HSEM_R23			MMIO32(HSEM_BASE + 0x5c)
/** HSEM_R24 HSEM register HSEM_R0 HSEM_R31 **/
#define HSEM_R24			MMIO32(HSEM_BASE + 0x60)
/** HSEM_R25 HSEM register HSEM_R0 HSEM_R31 **/
#define HSEM_R25			MMIO32(HSEM_BASE + 0x64)
/** HSEM_R26 HSEM register HSEM_R0 HSEM_R31 **/
#define HSEM_R26			MMIO32(HSEM_BASE + 0x68)
/** HSEM_R27 HSEM register HSEM_R0 HSEM_R31 **/
#define HSEM_R27			MMIO32(HSEM_BASE + 0x6c)
/** HSEM_R28 HSEM register HSEM_R0 HSEM_R31 **/
#define HSEM_R28			MMIO32(HSEM_BASE + 0x70)
/** HSEM_R29 HSEM register HSEM_R0 HSEM_R31 **/
#define HSEM_R29			MMIO32(HSEM_BASE + 0x74)
/** HSEM_R30 HSEM register HSEM_R0 HSEM_R31 **/
#define HSEM_R30			MMIO32(HSEM_BASE + 0x78)
/** HSEM_R31 HSEM register HSEM_R0 HSEM_R31 **/
#define HSEM_R31			MMIO32(HSEM_BASE + 0x7c)
/** HSEM_RLR0 HSEM Read lock register **/
#define HSEM_RLR0			MMIO32(HSEM_BASE + 0x80)
/** HSEM_RLR1 HSEM Read lock register **/
#define HSEM_RLR1			MMIO32(HSEM_BASE + 0x84)
/** HSEM_RLR2 HSEM Read lock register **/
#define HSEM_RLR2			MMIO32(HSEM_BASE + 0x88)
/** HSEM_RLR3 HSEM Read lock register **/
#define HSEM_RLR3			MMIO32(HSEM_BASE + 0x8c)
/** HSEM_RLR4 HSEM Read lock register **/
#define HSEM_RLR4			MMIO32(HSEM_BASE + 0x90)
/** HSEM_RLR5 HSEM Read lock register **/
#define HSEM_RLR5			MMIO32(HSEM_BASE + 0x94)
/** HSEM_RLR6 HSEM Read lock register **/
#define HSEM_RLR6			MMIO32(HSEM_BASE + 0x98)
/** HSEM_RLR7 HSEM Read lock register **/
#define HSEM_RLR7			MMIO32(HSEM_BASE + 0x9c)
/** HSEM_RLR8 HSEM Read lock register **/
#define HSEM_RLR8			MMIO32(HSEM_BASE + 0xa0)
/** HSEM_RLR9 HSEM Read lock register **/
#define HSEM_RLR9			MMIO32(HSEM_BASE + 0xa4)
/** HSEM_RLR10 HSEM Read lock register **/
#define HSEM_RLR10			MMIO32(HSEM_BASE + 0xa8)
/** HSEM_RLR11 HSEM Read lock register **/
#define HSEM_RLR11			MMIO32(HSEM_BASE + 0xac)
/** HSEM_RLR12 HSEM Read lock register **/
#define HSEM_RLR12			MMIO32(HSEM_BASE + 0xb0)
/** HSEM_RLR13 HSEM Read lock register **/
#define HSEM_RLR13			MMIO32(HSEM_BASE + 0xb4)
/** HSEM_RLR14 HSEM Read lock register **/
#define HSEM_RLR14			MMIO32(HSEM_BASE + 0xb8)
/** HSEM_RLR15 HSEM Read lock register **/
#define HSEM_RLR15			MMIO32(HSEM_BASE + 0xbc)
/** HSEM_RLR16 HSEM Read lock register **/
#define HSEM_RLR16			MMIO32(HSEM_BASE + 0xc0)
/** HSEM_RLR17 HSEM Read lock register **/
#define HSEM_RLR17			MMIO32(HSEM_BASE + 0xc4)
/** HSEM_RLR18 HSEM Read lock register **/
#define HSEM_RLR18			MMIO32(HSEM_BASE + 0xc8)
/** HSEM_RLR19 HSEM Read lock register **/
#define HSEM_RLR19			MMIO32(HSEM_BASE + 0xcc)
/** HSEM_RLR20 HSEM Read lock register **/
#define HSEM_RLR20			MMIO32(HSEM_BASE + 0xd0)
/** HSEM_RLR21 HSEM Read lock register **/
#define HSEM_RLR21			MMIO32(HSEM_BASE + 0xd4)
/** HSEM_RLR22 HSEM Read lock register **/
#define HSEM_RLR22			MMIO32(HSEM_BASE + 0xd8)
/** HSEM_RLR23 HSEM Read lock register **/
#define HSEM_RLR23			MMIO32(HSEM_BASE + 0xdc)
/** HSEM_RLR24 HSEM Read lock register **/
#define HSEM_RLR24			MMIO32(HSEM_BASE + 0xe0)
/** HSEM_RLR25 HSEM Read lock register **/
#define HSEM_RLR25			MMIO32(HSEM_BASE + 0xe4)
/** HSEM_RLR26 HSEM Read lock register **/
#define HSEM_RLR26			MMIO32(HSEM_BASE + 0xe8)
/** HSEM_RLR27 HSEM Read lock register **/
#define HSEM_RLR27			MMIO32(HSEM_BASE + 0xec)
/** HSEM_RLR28 HSEM Read lock register **/
#define HSEM_RLR28			MMIO32(HSEM_BASE + 0xf0)
/** HSEM_RLR29 HSEM Read lock register **/
#define HSEM_RLR29			MMIO32(HSEM_BASE + 0xf4)
/** HSEM_RLR30 HSEM Read lock register **/
#define HSEM_RLR30			MMIO32(HSEM_BASE + 0xf8)
/** HSEM_RLR31 HSEM Read lock register **/
#define HSEM_RLR31			MMIO32(HSEM_BASE + 0xfc)
/** HSEM_IER HSEM Interrupt enable register **/
#define HSEM_IER			MMIO32(HSEM_BASE + 0x100)
/** HSEM_ICR HSEM Interrupt clear register **/
#define HSEM_ICR			MMIO32(HSEM_BASE + 0x104)
/** HSEM_ISR HSEM Interrupt status register **/
#define HSEM_ISR			MMIO32(HSEM_BASE + 0x108)
/** HSEM_MISR HSEM Masked interrupt status register **/
#define HSEM_MISR			MMIO32(HSEM_BASE + 0x10c)
/** HSEM_CR HSEM Clear register **/
#define HSEM_CR			MMIO32(HSEM_BASE + 0x140)
/** HSEM_KEYR HSEM Interrupt clear register **/
#define HSEM_KEYR			MMIO32(HSEM_BASE + 0x144)

/**@}*/


/** @defgroup hsem_r0 R0 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_R0_LOCK Lock indication **/
#define HSEM_R0_LOCK		(1 << 31)

#define HSEM_R0_MASTERID_SHIFT		8
#define HSEM_R0_MASTERID_MASK		0xff
/** @defgroup hsem_r0_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_R0_PROCID_SHIFT		0
#define HSEM_R0_PROCID_MASK		0xff
/** @defgroup hsem_r0_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

