grevaillot/svd_tools/headers/STM32H7A3x/hsem.h
/** @defgroup hsem_r1 R1 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_R1_LOCK Lock indication **/
#define HSEM_R1_LOCK		(1 << 31)

#define HSEM_R1_MASTERID_SHIFT		8
#define HSEM_R1_MASTERID_MASK		0xff
/** @defgroup hsem_r1_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_R1_PROCID_SHIFT		0
#define HSEM_R1_PROCID_MASK		0xff
/** @defgroup hsem_r1_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_r2 R2 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_R2_LOCK Lock indication **/
#define HSEM_R2_LOCK		(1 << 31)

#define HSEM_R2_MASTERID_SHIFT		8
#define HSEM_R2_MASTERID_MASK		0xff
/** @defgroup hsem_r2_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_R2_PROCID_SHIFT		0
#define HSEM_R2_PROCID_MASK		0xff
/** @defgroup hsem_r2_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_r3 R3 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_R3_LOCK Lock indication **/
#define HSEM_R3_LOCK		(1 << 31)

#define HSEM_R3_MASTERID_SHIFT		8
#define HSEM_R3_MASTERID_MASK		0xff
/** @defgroup hsem_r3_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_R3_PROCID_SHIFT		0
#define HSEM_R3_PROCID_MASK		0xff
/** @defgroup hsem_r3_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_r4 R4 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_R4_LOCK Lock indication **/
#define HSEM_R4_LOCK		(1 << 31)

#define HSEM_R4_MASTERID_SHIFT		8
#define HSEM_R4_MASTERID_MASK		0xff
/** @defgroup hsem_r4_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_R4_PROCID_SHIFT		0
#define HSEM_R4_PROCID_MASK		0xff
/** @defgroup hsem_r4_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_r5 R5 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_R5_LOCK Lock indication **/
#define HSEM_R5_LOCK		(1 << 31)

#define HSEM_R5_MASTERID_SHIFT		8
#define HSEM_R5_MASTERID_MASK		0xff
/** @defgroup hsem_r5_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_R5_PROCID_SHIFT		0
#define HSEM_R5_PROCID_MASK		0xff
/** @defgroup hsem_r5_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_r6 R6 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_R6_LOCK Lock indication **/
#define HSEM_R6_LOCK		(1 << 31)

#define HSEM_R6_MASTERID_SHIFT		8
#define HSEM_R6_MASTERID_MASK		0xff
/** @defgroup hsem_r6_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_R6_PROCID_SHIFT		0
#define HSEM_R6_PROCID_MASK		0xff
/** @defgroup hsem_r6_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_r7 R7 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_R7_LOCK Lock indication **/
#define HSEM_R7_LOCK		(1 << 31)

#define HSEM_R7_MASTERID_SHIFT		8
#define HSEM_R7_MASTERID_MASK		0xff
/** @defgroup hsem_r7_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_R7_PROCID_SHIFT		0
#define HSEM_R7_PROCID_MASK		0xff
/** @defgroup hsem_r7_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_r8 R8 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_R8_LOCK Lock indication **/
#define HSEM_R8_LOCK		(1 << 31)

#define HSEM_R8_MASTERID_SHIFT		8
#define HSEM_R8_MASTERID_MASK		0xff
/** @defgroup hsem_r8_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_R8_PROCID_SHIFT		0
#define HSEM_R8_PROCID_MASK		0xff
/** @defgroup hsem_r8_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_r9 R9 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_R9_LOCK Lock indication **/
#define HSEM_R9_LOCK		(1 << 31)

#define HSEM_R9_MASTERID_SHIFT		8
#define HSEM_R9_MASTERID_MASK		0xff
/** @defgroup hsem_r9_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_R9_PROCID_SHIFT		0
#define HSEM_R9_PROCID_MASK		0xff
/** @defgroup hsem_r9_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_r10 R10 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_R10_LOCK Lock indication **/
#define HSEM_R10_LOCK		(1 << 31)

#define HSEM_R10_MASTERID_SHIFT		8
#define HSEM_R10_MASTERID_MASK		0xff
/** @defgroup hsem_r10_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_R10_PROCID_SHIFT		0
#define HSEM_R10_PROCID_MASK		0xff
/** @defgroup hsem_r10_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_r11 R11 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_R11_LOCK Lock indication **/
#define HSEM_R11_LOCK		(1 << 31)

#define HSEM_R11_MASTERID_SHIFT		8
#define HSEM_R11_MASTERID_MASK		0xff
/** @defgroup hsem_r11_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_R11_PROCID_SHIFT		0
#define HSEM_R11_PROCID_MASK		0xff
/** @defgroup hsem_r11_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_r12 R12 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_R12_LOCK Lock indication **/
#define HSEM_R12_LOCK		(1 << 31)

#define HSEM_R12_MASTERID_SHIFT		8
#define HSEM_R12_MASTERID_MASK		0xff
/** @defgroup hsem_r12_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_R12_PROCID_SHIFT		0
#define HSEM_R12_PROCID_MASK		0xff
/** @defgroup hsem_r12_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_r13 R13 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_R13_LOCK Lock indication **/
#define HSEM_R13_LOCK		(1 << 31)

#define HSEM_R13_MASTERID_SHIFT		8
#define HSEM_R13_MASTERID_MASK		0xff
/** @defgroup hsem_r13_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_R13_PROCID_SHIFT		0
#define HSEM_R13_PROCID_MASK		0xff
/** @defgroup hsem_r13_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_r14 R14 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_R14_LOCK Lock indication **/
#define HSEM_R14_LOCK		(1 << 31)

#define HSEM_R14_MASTERID_SHIFT		8
#define HSEM_R14_MASTERID_MASK		0xff
/** @defgroup hsem_r14_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_R14_PROCID_SHIFT		0
#define HSEM_R14_PROCID_MASK		0xff
/** @defgroup hsem_r14_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_r15 R15 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_R15_LOCK Lock indication **/
#define HSEM_R15_LOCK		(1 << 31)

