grevaillot/svd_tools/headers/STM32H7A3x/hsem.h
#define HSEM_R15_MASTERID_SHIFT		8
#define HSEM_R15_MASTERID_MASK		0xff
/** @defgroup hsem_r15_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_R15_PROCID_SHIFT		0
#define HSEM_R15_PROCID_MASK		0xff
/** @defgroup hsem_r15_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_r16 R16 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_R16_LOCK Lock indication **/
#define HSEM_R16_LOCK		(1 << 31)

#define HSEM_R16_MASTERID_SHIFT		8
#define HSEM_R16_MASTERID_MASK		0xff
/** @defgroup hsem_r16_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_R16_PROCID_SHIFT		0
#define HSEM_R16_PROCID_MASK		0xff
/** @defgroup hsem_r16_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_r17 R17 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_R17_LOCK Lock indication **/
#define HSEM_R17_LOCK		(1 << 31)

#define HSEM_R17_MASTERID_SHIFT		8
#define HSEM_R17_MASTERID_MASK		0xff
/** @defgroup hsem_r17_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_R17_PROCID_SHIFT		0
#define HSEM_R17_PROCID_MASK		0xff
/** @defgroup hsem_r17_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_r18 R18 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_R18_LOCK Lock indication **/
#define HSEM_R18_LOCK		(1 << 31)

#define HSEM_R18_MASTERID_SHIFT		8
#define HSEM_R18_MASTERID_MASK		0xff
/** @defgroup hsem_r18_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_R18_PROCID_SHIFT		0
#define HSEM_R18_PROCID_MASK		0xff
/** @defgroup hsem_r18_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_r19 R19 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_R19_LOCK Lock indication **/
#define HSEM_R19_LOCK		(1 << 31)

#define HSEM_R19_MASTERID_SHIFT		8
#define HSEM_R19_MASTERID_MASK		0xff
/** @defgroup hsem_r19_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_R19_PROCID_SHIFT		0
#define HSEM_R19_PROCID_MASK		0xff
/** @defgroup hsem_r19_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_r20 R20 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_R20_LOCK Lock indication **/
#define HSEM_R20_LOCK		(1 << 31)

#define HSEM_R20_MASTERID_SHIFT		8
#define HSEM_R20_MASTERID_MASK		0xff
/** @defgroup hsem_r20_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_R20_PROCID_SHIFT		0
#define HSEM_R20_PROCID_MASK		0xff
/** @defgroup hsem_r20_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_r21 R21 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_R21_LOCK Lock indication **/
#define HSEM_R21_LOCK		(1 << 31)

#define HSEM_R21_MASTERID_SHIFT		8
#define HSEM_R21_MASTERID_MASK		0xff
/** @defgroup hsem_r21_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_R21_PROCID_SHIFT		0
#define HSEM_R21_PROCID_MASK		0xff
/** @defgroup hsem_r21_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_r22 R22 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_R22_LOCK Lock indication **/
#define HSEM_R22_LOCK		(1 << 31)

#define HSEM_R22_MASTERID_SHIFT		8
#define HSEM_R22_MASTERID_MASK		0xff
/** @defgroup hsem_r22_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_R22_PROCID_SHIFT		0
#define HSEM_R22_PROCID_MASK		0xff
/** @defgroup hsem_r22_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_r23 R23 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_R23_LOCK Lock indication **/
#define HSEM_R23_LOCK		(1 << 31)

#define HSEM_R23_MASTERID_SHIFT		8
#define HSEM_R23_MASTERID_MASK		0xff
/** @defgroup hsem_r23_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_R23_PROCID_SHIFT		0
#define HSEM_R23_PROCID_MASK		0xff
/** @defgroup hsem_r23_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_r24 R24 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_R24_LOCK Lock indication **/
#define HSEM_R24_LOCK		(1 << 31)

#define HSEM_R24_MASTERID_SHIFT		8
#define HSEM_R24_MASTERID_MASK		0xff
/** @defgroup hsem_r24_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_R24_PROCID_SHIFT		0
#define HSEM_R24_PROCID_MASK		0xff
/** @defgroup hsem_r24_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_r25 R25 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_R25_LOCK Lock indication **/
#define HSEM_R25_LOCK		(1 << 31)

#define HSEM_R25_MASTERID_SHIFT		8
#define HSEM_R25_MASTERID_MASK		0xff
/** @defgroup hsem_r25_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_R25_PROCID_SHIFT		0
#define HSEM_R25_PROCID_MASK		0xff
/** @defgroup hsem_r25_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_r26 R26 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_R26_LOCK Lock indication **/
#define HSEM_R26_LOCK		(1 << 31)

#define HSEM_R26_MASTERID_SHIFT		8
#define HSEM_R26_MASTERID_MASK		0xff
/** @defgroup hsem_r26_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_R26_PROCID_SHIFT		0
#define HSEM_R26_PROCID_MASK		0xff
/** @defgroup hsem_r26_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_r27 R27 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_R27_LOCK Lock indication **/
#define HSEM_R27_LOCK		(1 << 31)

#define HSEM_R27_MASTERID_SHIFT		8
#define HSEM_R27_MASTERID_MASK		0xff
/** @defgroup hsem_r27_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_R27_PROCID_SHIFT		0
#define HSEM_R27_PROCID_MASK		0xff
/** @defgroup hsem_r27_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_r28 R28 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_R28_LOCK Lock indication **/
#define HSEM_R28_LOCK		(1 << 31)

#define HSEM_R28_MASTERID_SHIFT		8
#define HSEM_R28_MASTERID_MASK		0xff
/** @defgroup hsem_r28_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_R28_PROCID_SHIFT		0
#define HSEM_R28_PROCID_MASK		0xff
/** @defgroup hsem_r28_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_r29 R29 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_R29_LOCK Lock indication **/
#define HSEM_R29_LOCK		(1 << 31)

#define HSEM_R29_MASTERID_SHIFT		8
#define HSEM_R29_MASTERID_MASK		0xff
/** @defgroup hsem_r29_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


