grevaillot/svd_tools/headers/STM32H7A3x/hsem.h
#define HSEM_R29_PROCID_SHIFT		0
#define HSEM_R29_PROCID_MASK		0xff
/** @defgroup hsem_r29_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_r30 R30 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_R30_LOCK Lock indication **/
#define HSEM_R30_LOCK		(1 << 31)

#define HSEM_R30_MASTERID_SHIFT		8
#define HSEM_R30_MASTERID_MASK		0xff
/** @defgroup hsem_r30_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_R30_PROCID_SHIFT		0
#define HSEM_R30_PROCID_MASK		0xff
/** @defgroup hsem_r30_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_r31 R31 HSEM register HSEM_R0 HSEM_R31
@{*/

/** HSEM_R31_LOCK Lock indication **/
#define HSEM_R31_LOCK		(1 << 31)

#define HSEM_R31_MASTERID_SHIFT		8
#define HSEM_R31_MASTERID_MASK		0xff
/** @defgroup hsem_r31_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_R31_PROCID_SHIFT		0
#define HSEM_R31_PROCID_MASK		0xff
/** @defgroup hsem_r31_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_rlr0 RLR0 HSEM Read lock register
@{*/

/** HSEM_RLR0_LOCK Lock indication **/
#define HSEM_RLR0_LOCK		(1 << 31)

#define HSEM_RLR0_MASTERID_SHIFT		8
#define HSEM_RLR0_MASTERID_MASK		0xff
/** @defgroup hsem_rlr0_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_RLR0_PROCID_SHIFT		0
#define HSEM_RLR0_PROCID_MASK		0xff
/** @defgroup hsem_rlr0_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_rlr1 RLR1 HSEM Read lock register
@{*/

/** HSEM_RLR1_LOCK Lock indication **/
#define HSEM_RLR1_LOCK		(1 << 31)

#define HSEM_RLR1_MASTERID_SHIFT		8
#define HSEM_RLR1_MASTERID_MASK		0xff
/** @defgroup hsem_rlr1_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_RLR1_PROCID_SHIFT		0
#define HSEM_RLR1_PROCID_MASK		0xff
/** @defgroup hsem_rlr1_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_rlr2 RLR2 HSEM Read lock register
@{*/

/** HSEM_RLR2_LOCK Lock indication **/
#define HSEM_RLR2_LOCK		(1 << 31)

#define HSEM_RLR2_MASTERID_SHIFT		8
#define HSEM_RLR2_MASTERID_MASK		0xff
/** @defgroup hsem_rlr2_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_RLR2_PROCID_SHIFT		0
#define HSEM_RLR2_PROCID_MASK		0xff
/** @defgroup hsem_rlr2_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_rlr3 RLR3 HSEM Read lock register
@{*/

/** HSEM_RLR3_LOCK Lock indication **/
#define HSEM_RLR3_LOCK		(1 << 31)

#define HSEM_RLR3_MASTERID_SHIFT		8
#define HSEM_RLR3_MASTERID_MASK		0xff
/** @defgroup hsem_rlr3_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_RLR3_PROCID_SHIFT		0
#define HSEM_RLR3_PROCID_MASK		0xff
/** @defgroup hsem_rlr3_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_rlr4 RLR4 HSEM Read lock register
@{*/

/** HSEM_RLR4_LOCK Lock indication **/
#define HSEM_RLR4_LOCK		(1 << 31)

#define HSEM_RLR4_MASTERID_SHIFT		8
#define HSEM_RLR4_MASTERID_MASK		0xff
/** @defgroup hsem_rlr4_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_RLR4_PROCID_SHIFT		0
#define HSEM_RLR4_PROCID_MASK		0xff
/** @defgroup hsem_rlr4_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_rlr5 RLR5 HSEM Read lock register
@{*/

/** HSEM_RLR5_LOCK Lock indication **/
#define HSEM_RLR5_LOCK		(1 << 31)

#define HSEM_RLR5_MASTERID_SHIFT		8
#define HSEM_RLR5_MASTERID_MASK		0xff
/** @defgroup hsem_rlr5_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_RLR5_PROCID_SHIFT		0
#define HSEM_RLR5_PROCID_MASK		0xff
/** @defgroup hsem_rlr5_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_rlr6 RLR6 HSEM Read lock register
@{*/

/** HSEM_RLR6_LOCK Lock indication **/
#define HSEM_RLR6_LOCK		(1 << 31)

#define HSEM_RLR6_MASTERID_SHIFT		8
#define HSEM_RLR6_MASTERID_MASK		0xff
/** @defgroup hsem_rlr6_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_RLR6_PROCID_SHIFT		0
#define HSEM_RLR6_PROCID_MASK		0xff
/** @defgroup hsem_rlr6_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_rlr7 RLR7 HSEM Read lock register
@{*/

/** HSEM_RLR7_LOCK Lock indication **/
#define HSEM_RLR7_LOCK		(1 << 31)

#define HSEM_RLR7_MASTERID_SHIFT		8
#define HSEM_RLR7_MASTERID_MASK		0xff
/** @defgroup hsem_rlr7_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_RLR7_PROCID_SHIFT		0
#define HSEM_RLR7_PROCID_MASK		0xff
/** @defgroup hsem_rlr7_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_rlr8 RLR8 HSEM Read lock register
@{*/

/** HSEM_RLR8_LOCK Lock indication **/
#define HSEM_RLR8_LOCK		(1 << 31)

#define HSEM_RLR8_MASTERID_SHIFT		8
#define HSEM_RLR8_MASTERID_MASK		0xff
/** @defgroup hsem_rlr8_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_RLR8_PROCID_SHIFT		0
#define HSEM_RLR8_PROCID_MASK		0xff
/** @defgroup hsem_rlr8_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_rlr9 RLR9 HSEM Read lock register
@{*/

/** HSEM_RLR9_LOCK Lock indication **/
#define HSEM_RLR9_LOCK		(1 << 31)

#define HSEM_RLR9_MASTERID_SHIFT		8
#define HSEM_RLR9_MASTERID_MASK		0xff
/** @defgroup hsem_rlr9_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_RLR9_PROCID_SHIFT		0
#define HSEM_RLR9_PROCID_MASK		0xff
/** @defgroup hsem_rlr9_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_rlr10 RLR10 HSEM Read lock register
@{*/

/** HSEM_RLR10_LOCK Lock indication **/
#define HSEM_RLR10_LOCK		(1 << 31)

#define HSEM_RLR10_MASTERID_SHIFT		8
#define HSEM_RLR10_MASTERID_MASK		0xff
/** @defgroup hsem_rlr10_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_RLR10_PROCID_SHIFT		0
#define HSEM_RLR10_PROCID_MASK		0xff
/** @defgroup hsem_rlr10_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_rlr11 RLR11 HSEM Read lock register
@{*/

/** HSEM_RLR11_LOCK Lock indication **/
#define HSEM_RLR11_LOCK		(1 << 31)

#define HSEM_RLR11_MASTERID_SHIFT		8
#define HSEM_RLR11_MASTERID_MASK		0xff
/** @defgroup hsem_rlr11_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


