grevaillot/svd_tools/headers/STM32H7A3x/hsem.h
#define HSEM_RLR11_PROCID_SHIFT		0
#define HSEM_RLR11_PROCID_MASK		0xff
/** @defgroup hsem_rlr11_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_rlr12 RLR12 HSEM Read lock register
@{*/

/** HSEM_RLR12_LOCK Lock indication **/
#define HSEM_RLR12_LOCK		(1 << 31)

#define HSEM_RLR12_MASTERID_SHIFT		8
#define HSEM_RLR12_MASTERID_MASK		0xff
/** @defgroup hsem_rlr12_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_RLR12_PROCID_SHIFT		0
#define HSEM_RLR12_PROCID_MASK		0xff
/** @defgroup hsem_rlr12_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_rlr13 RLR13 HSEM Read lock register
@{*/

/** HSEM_RLR13_LOCK Lock indication **/
#define HSEM_RLR13_LOCK		(1 << 31)

#define HSEM_RLR13_MASTERID_SHIFT		8
#define HSEM_RLR13_MASTERID_MASK		0xff
/** @defgroup hsem_rlr13_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_RLR13_PROCID_SHIFT		0
#define HSEM_RLR13_PROCID_MASK		0xff
/** @defgroup hsem_rlr13_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_rlr14 RLR14 HSEM Read lock register
@{*/

/** HSEM_RLR14_LOCK Lock indication **/
#define HSEM_RLR14_LOCK		(1 << 31)

#define HSEM_RLR14_MASTERID_SHIFT		8
#define HSEM_RLR14_MASTERID_MASK		0xff
/** @defgroup hsem_rlr14_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_RLR14_PROCID_SHIFT		0
#define HSEM_RLR14_PROCID_MASK		0xff
/** @defgroup hsem_rlr14_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_rlr15 RLR15 HSEM Read lock register
@{*/

/** HSEM_RLR15_LOCK Lock indication **/
#define HSEM_RLR15_LOCK		(1 << 31)

#define HSEM_RLR15_MASTERID_SHIFT		8
#define HSEM_RLR15_MASTERID_MASK		0xff
/** @defgroup hsem_rlr15_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_RLR15_PROCID_SHIFT		0
#define HSEM_RLR15_PROCID_MASK		0xff
/** @defgroup hsem_rlr15_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_rlr16 RLR16 HSEM Read lock register
@{*/

/** HSEM_RLR16_LOCK Lock indication **/
#define HSEM_RLR16_LOCK		(1 << 31)

#define HSEM_RLR16_MASTERID_SHIFT		8
#define HSEM_RLR16_MASTERID_MASK		0xff
/** @defgroup hsem_rlr16_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_RLR16_PROCID_SHIFT		0
#define HSEM_RLR16_PROCID_MASK		0xff
/** @defgroup hsem_rlr16_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_rlr17 RLR17 HSEM Read lock register
@{*/

/** HSEM_RLR17_LOCK Lock indication **/
#define HSEM_RLR17_LOCK		(1 << 31)

#define HSEM_RLR17_MASTERID_SHIFT		8
#define HSEM_RLR17_MASTERID_MASK		0xff
/** @defgroup hsem_rlr17_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_RLR17_PROCID_SHIFT		0
#define HSEM_RLR17_PROCID_MASK		0xff
/** @defgroup hsem_rlr17_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_rlr18 RLR18 HSEM Read lock register
@{*/

/** HSEM_RLR18_LOCK Lock indication **/
#define HSEM_RLR18_LOCK		(1 << 31)

#define HSEM_RLR18_MASTERID_SHIFT		8
#define HSEM_RLR18_MASTERID_MASK		0xff
/** @defgroup hsem_rlr18_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_RLR18_PROCID_SHIFT		0
#define HSEM_RLR18_PROCID_MASK		0xff
/** @defgroup hsem_rlr18_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_rlr19 RLR19 HSEM Read lock register
@{*/

/** HSEM_RLR19_LOCK Lock indication **/
#define HSEM_RLR19_LOCK		(1 << 31)

#define HSEM_RLR19_MASTERID_SHIFT		8
#define HSEM_RLR19_MASTERID_MASK		0xff
/** @defgroup hsem_rlr19_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_RLR19_PROCID_SHIFT		0
#define HSEM_RLR19_PROCID_MASK		0xff
/** @defgroup hsem_rlr19_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_rlr20 RLR20 HSEM Read lock register
@{*/

/** HSEM_RLR20_LOCK Lock indication **/
#define HSEM_RLR20_LOCK		(1 << 31)

#define HSEM_RLR20_MASTERID_SHIFT		8
#define HSEM_RLR20_MASTERID_MASK		0xff
/** @defgroup hsem_rlr20_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_RLR20_PROCID_SHIFT		0
#define HSEM_RLR20_PROCID_MASK		0xff
/** @defgroup hsem_rlr20_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_rlr21 RLR21 HSEM Read lock register
@{*/

/** HSEM_RLR21_LOCK Lock indication **/
#define HSEM_RLR21_LOCK		(1 << 31)

#define HSEM_RLR21_MASTERID_SHIFT		8
#define HSEM_RLR21_MASTERID_MASK		0xff
/** @defgroup hsem_rlr21_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_RLR21_PROCID_SHIFT		0
#define HSEM_RLR21_PROCID_MASK		0xff
/** @defgroup hsem_rlr21_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_rlr22 RLR22 HSEM Read lock register
@{*/

/** HSEM_RLR22_LOCK Lock indication **/
#define HSEM_RLR22_LOCK		(1 << 31)

#define HSEM_RLR22_MASTERID_SHIFT		8
#define HSEM_RLR22_MASTERID_MASK		0xff
/** @defgroup hsem_rlr22_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_RLR22_PROCID_SHIFT		0
#define HSEM_RLR22_PROCID_MASK		0xff
/** @defgroup hsem_rlr22_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_rlr23 RLR23 HSEM Read lock register
@{*/

/** HSEM_RLR23_LOCK Lock indication **/
#define HSEM_RLR23_LOCK		(1 << 31)

#define HSEM_RLR23_MASTERID_SHIFT		8
#define HSEM_RLR23_MASTERID_MASK		0xff
/** @defgroup hsem_rlr23_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_RLR23_PROCID_SHIFT		0
#define HSEM_RLR23_PROCID_MASK		0xff
/** @defgroup hsem_rlr23_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_rlr24 RLR24 HSEM Read lock register
@{*/

/** HSEM_RLR24_LOCK Lock indication **/
#define HSEM_RLR24_LOCK		(1 << 31)

#define HSEM_RLR24_MASTERID_SHIFT		8
#define HSEM_RLR24_MASTERID_MASK		0xff
/** @defgroup hsem_rlr24_masterid MASTERID Semaphore MasterID
@{*/
/**@}*/


#define HSEM_RLR24_PROCID_SHIFT		0
#define HSEM_RLR24_PROCID_MASK		0xff
/** @defgroup hsem_rlr24_procid PROCID Semaphore ProcessID
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_rlr25 RLR25 HSEM Read lock register
@{*/

