grevaillot/svd_tools/headers/STM32H7A3x/hsem.h
/** HSEM_ICR_ISEM31 Interrupt(N) semaphore n clear bit **/
#define HSEM_ICR_ISEM31		(1 << 31)
/** HSEM_ICR_ISEM30 Interrupt(N) semaphore n clear bit **/
#define HSEM_ICR_ISEM30		(1 << 30)
/** HSEM_ICR_ISEM29 Interrupt(N) semaphore n clear bit **/
#define HSEM_ICR_ISEM29		(1 << 29)
/** HSEM_ICR_ISEM28 Interrupt(N) semaphore n clear bit **/
#define HSEM_ICR_ISEM28		(1 << 28)
/** HSEM_ICR_ISEM27 Interrupt(N) semaphore n clear bit **/
#define HSEM_ICR_ISEM27		(1 << 27)
/** HSEM_ICR_ISEM26 Interrupt(N) semaphore n clear bit **/
#define HSEM_ICR_ISEM26		(1 << 26)
/** HSEM_ICR_ISEM25 Interrupt(N) semaphore n clear bit **/
#define HSEM_ICR_ISEM25		(1 << 25)
/** HSEM_ICR_ISEM24 Interrupt(N) semaphore n clear bit **/
#define HSEM_ICR_ISEM24		(1 << 24)
/** HSEM_ICR_ISEM23 Interrupt(N) semaphore n clear bit **/
#define HSEM_ICR_ISEM23		(1 << 23)
/** HSEM_ICR_ISEM22 Interrupt(N) semaphore n clear bit **/
#define HSEM_ICR_ISEM22		(1 << 22)
/** HSEM_ICR_ISEM21 Interrupt(N) semaphore n clear bit **/
#define HSEM_ICR_ISEM21		(1 << 21)
/** HSEM_ICR_ISEM20 Interrupt(N) semaphore n clear bit **/
#define HSEM_ICR_ISEM20		(1 << 20)
/** HSEM_ICR_ISEM19 Interrupt(N) semaphore n clear bit **/
#define HSEM_ICR_ISEM19		(1 << 19)
/** HSEM_ICR_ISEM18 Interrupt(N) semaphore n clear bit **/
#define HSEM_ICR_ISEM18		(1 << 18)
/** HSEM_ICR_ISEM17 Interrupt(N) semaphore n clear bit **/
#define HSEM_ICR_ISEM17		(1 << 17)
/** HSEM_ICR_ISEM16 Interrupt(N) semaphore n clear bit **/
#define HSEM_ICR_ISEM16		(1 << 16)
/** HSEM_ICR_ISEM15 Interrupt(N) semaphore n clear bit **/
#define HSEM_ICR_ISEM15		(1 << 15)
/** HSEM_ICR_ISEM14 Interrupt(N) semaphore n clear bit **/
#define HSEM_ICR_ISEM14		(1 << 14)
/** HSEM_ICR_ISEM13 Interrupt(N) semaphore n clear bit **/
#define HSEM_ICR_ISEM13		(1 << 13)
/** HSEM_ICR_ISEM12 Interrupt(N) semaphore n clear bit **/
#define HSEM_ICR_ISEM12		(1 << 12)
/** HSEM_ICR_ISEM11 Interrupt(N) semaphore n clear bit **/
#define HSEM_ICR_ISEM11		(1 << 11)
/** HSEM_ICR_ISEM10 Interrupt(N) semaphore n clear bit **/
#define HSEM_ICR_ISEM10		(1 << 10)
/** HSEM_ICR_ISEM9 Interrupt(N) semaphore n clear bit **/
#define HSEM_ICR_ISEM9		(1 << 9)
/** HSEM_ICR_ISEM8 Interrupt(N) semaphore n clear bit **/
#define HSEM_ICR_ISEM8		(1 << 8)
/** HSEM_ICR_ISEM7 Interrupt(N) semaphore n clear bit **/
#define HSEM_ICR_ISEM7		(1 << 7)
/** HSEM_ICR_ISEM6 Interrupt(N) semaphore n clear bit **/
#define HSEM_ICR_ISEM6		(1 << 6)
/** HSEM_ICR_ISEM5 Interrupt(N) semaphore n clear bit **/
#define HSEM_ICR_ISEM5		(1 << 5)
/** HSEM_ICR_ISEM4 Interrupt(N) semaphore n clear bit **/
#define HSEM_ICR_ISEM4		(1 << 4)
/** HSEM_ICR_ISEM3 Interrupt(N) semaphore n clear bit **/
#define HSEM_ICR_ISEM3		(1 << 3)
/** HSEM_ICR_ISEM2 Interrupt(N) semaphore n clear bit **/
#define HSEM_ICR_ISEM2		(1 << 2)
/** HSEM_ICR_ISEM1 Interrupt(N) semaphore n clear bit **/
#define HSEM_ICR_ISEM1		(1 << 1)
/** HSEM_ICR_ISEM0 Interrupt(N) semaphore n clear bit **/
#define HSEM_ICR_ISEM0		(1 << 0)

/**@}*/

/** @defgroup hsem_isr ISR HSEM Interrupt status register
@{*/

/** HSEM_ISR_ISEM31 Interrupt(N) semaphore n status bit before enable (mask) **/
#define HSEM_ISR_ISEM31		(1 << 31)
/** HSEM_ISR_ISEM30 Interrupt(N) semaphore n status bit before enable (mask) **/
#define HSEM_ISR_ISEM30		(1 << 30)
/** HSEM_ISR_ISEM29 Interrupt(N) semaphore n status bit before enable (mask) **/
#define HSEM_ISR_ISEM29		(1 << 29)
/** HSEM_ISR_ISEM28 Interrupt(N) semaphore n status bit before enable (mask) **/
#define HSEM_ISR_ISEM28		(1 << 28)
/** HSEM_ISR_ISEM27 Interrupt(N) semaphore n status bit before enable (mask) **/
#define HSEM_ISR_ISEM27		(1 << 27)
/** HSEM_ISR_ISEM26 Interrupt(N) semaphore n status bit before enable (mask) **/
#define HSEM_ISR_ISEM26		(1 << 26)
/** HSEM_ISR_ISEM25 Interrupt(N) semaphore n status bit before enable (mask) **/
#define HSEM_ISR_ISEM25		(1 << 25)
/** HSEM_ISR_ISEM24 Interrupt(N) semaphore n status bit before enable (mask) **/
#define HSEM_ISR_ISEM24		(1 << 24)
/** HSEM_ISR_ISEM23 Interrupt(N) semaphore n status bit before enable (mask) **/
#define HSEM_ISR_ISEM23		(1 << 23)
/** HSEM_ISR_ISEM22 Interrupt(N) semaphore n status bit before enable (mask) **/
#define HSEM_ISR_ISEM22		(1 << 22)
/** HSEM_ISR_ISEM21 Interrupt(N) semaphore n status bit before enable (mask) **/
#define HSEM_ISR_ISEM21		(1 << 21)
/** HSEM_ISR_ISEM20 Interrupt(N) semaphore n status bit before enable (mask) **/
#define HSEM_ISR_ISEM20		(1 << 20)
/** HSEM_ISR_ISEM19 Interrupt(N) semaphore n status bit before enable (mask) **/
#define HSEM_ISR_ISEM19		(1 << 19)
/** HSEM_ISR_ISEM18 Interrupt(N) semaphore n status bit before enable (mask) **/
#define HSEM_ISR_ISEM18		(1 << 18)
/** HSEM_ISR_ISEM17 Interrupt(N) semaphore n status bit before enable (mask) **/
#define HSEM_ISR_ISEM17		(1 << 17)
/** HSEM_ISR_ISEM16 Interrupt(N) semaphore n status bit before enable (mask) **/
#define HSEM_ISR_ISEM16		(1 << 16)
/** HSEM_ISR_ISEM15 Interrupt(N) semaphore n status bit before enable (mask) **/
#define HSEM_ISR_ISEM15		(1 << 15)
/** HSEM_ISR_ISEM14 Interrupt(N) semaphore n status bit before enable (mask) **/
#define HSEM_ISR_ISEM14		(1 << 14)
/** HSEM_ISR_ISEM13 Interrupt(N) semaphore n status bit before enable (mask) **/
#define HSEM_ISR_ISEM13		(1 << 13)
/** HSEM_ISR_ISEM12 Interrupt(N) semaphore n status bit before enable (mask) **/
#define HSEM_ISR_ISEM12		(1 << 12)
/** HSEM_ISR_ISEM11 Interrupt(N) semaphore n status bit before enable (mask) **/
#define HSEM_ISR_ISEM11		(1 << 11)
/** HSEM_ISR_ISEM10 Interrupt(N) semaphore n status bit before enable (mask) **/
#define HSEM_ISR_ISEM10		(1 << 10)
/** HSEM_ISR_ISEM9 Interrupt(N) semaphore n status bit before enable (mask) **/
#define HSEM_ISR_ISEM9		(1 << 9)
/** HSEM_ISR_ISEM8 Interrupt(N) semaphore n status bit before enable (mask) **/
#define HSEM_ISR_ISEM8		(1 << 8)
/** HSEM_ISR_ISEM7 Interrupt(N) semaphore n status bit before enable (mask) **/
#define HSEM_ISR_ISEM7		(1 << 7)
/** HSEM_ISR_ISEM6 Interrupt(N) semaphore n status bit before enable (mask) **/
#define HSEM_ISR_ISEM6		(1 << 6)
/** HSEM_ISR_ISEM5 Interrupt(N) semaphore n status bit before enable (mask) **/
#define HSEM_ISR_ISEM5		(1 << 5)
/** HSEM_ISR_ISEM4 Interrupt(N) semaphore n status bit before enable (mask) **/
#define HSEM_ISR_ISEM4		(1 << 4)
/** HSEM_ISR_ISEM3 Interrupt(N) semaphore n status bit before enable (mask) **/
#define HSEM_ISR_ISEM3		(1 << 3)
/** HSEM_ISR_ISEM2 Interrupt(N) semaphore n status bit before enable (mask) **/
#define HSEM_ISR_ISEM2		(1 << 2)
/** HSEM_ISR_ISEM1 Interrupt(N) semaphore n status bit before enable (mask) **/
#define HSEM_ISR_ISEM1		(1 << 1)
/** HSEM_ISR_ISEM0 Interrupt(N) semaphore n status bit before enable (mask) **/
#define HSEM_ISR_ISEM0		(1 << 0)

/**@}*/

