grevaillot/svd_tools/headers/STM32H7A3x/hsem.h
/** @defgroup hsem_misr MISR HSEM Masked interrupt status register
@{*/

/** HSEM_MISR_ISEM31 masked interrupt(N) semaphore n status bit after enable (mask) **/
#define HSEM_MISR_ISEM31		(1 << 31)
/** HSEM_MISR_ISEM30 masked interrupt(N) semaphore n status bit after enable (mask) **/
#define HSEM_MISR_ISEM30		(1 << 30)
/** HSEM_MISR_ISEM29 masked interrupt(N) semaphore n status bit after enable (mask) **/
#define HSEM_MISR_ISEM29		(1 << 29)
/** HSEM_MISR_ISEM28 masked interrupt(N) semaphore n status bit after enable (mask) **/
#define HSEM_MISR_ISEM28		(1 << 28)
/** HSEM_MISR_ISEM27 masked interrupt(N) semaphore n status bit after enable (mask) **/
#define HSEM_MISR_ISEM27		(1 << 27)
/** HSEM_MISR_ISEM26 masked interrupt(N) semaphore n status bit after enable (mask) **/
#define HSEM_MISR_ISEM26		(1 << 26)
/** HSEM_MISR_ISEM25 masked interrupt(N) semaphore n status bit after enable (mask) **/
#define HSEM_MISR_ISEM25		(1 << 25)
/** HSEM_MISR_ISEM24 masked interrupt(N) semaphore n status bit after enable (mask) **/
#define HSEM_MISR_ISEM24		(1 << 24)
/** HSEM_MISR_ISEM23 masked interrupt(N) semaphore n status bit after enable (mask) **/
#define HSEM_MISR_ISEM23		(1 << 23)
/** HSEM_MISR_ISEM22 masked interrupt(N) semaphore n status bit after enable (mask) **/
#define HSEM_MISR_ISEM22		(1 << 22)
/** HSEM_MISR_ISEM21 masked interrupt(N) semaphore n status bit after enable (mask) **/
#define HSEM_MISR_ISEM21		(1 << 21)
/** HSEM_MISR_ISEM20 masked interrupt(N) semaphore n status bit after enable (mask) **/
#define HSEM_MISR_ISEM20		(1 << 20)
/** HSEM_MISR_ISEM19 masked interrupt(N) semaphore n status bit after enable (mask) **/
#define HSEM_MISR_ISEM19		(1 << 19)
/** HSEM_MISR_ISEM18 masked interrupt(N) semaphore n status bit after enable (mask) **/
#define HSEM_MISR_ISEM18		(1 << 18)
/** HSEM_MISR_ISEM17 masked interrupt(N) semaphore n status bit after enable (mask) **/
#define HSEM_MISR_ISEM17		(1 << 17)
/** HSEM_MISR_ISEM16 masked interrupt(N) semaphore n status bit after enable (mask) **/
#define HSEM_MISR_ISEM16		(1 << 16)
/** HSEM_MISR_ISEM15 masked interrupt(N) semaphore n status bit after enable (mask) **/
#define HSEM_MISR_ISEM15		(1 << 15)
/** HSEM_MISR_ISEM14 masked interrupt(N) semaphore n status bit after enable (mask) **/
#define HSEM_MISR_ISEM14		(1 << 14)
/** HSEM_MISR_ISEM13 masked interrupt(N) semaphore n status bit after enable (mask) **/
#define HSEM_MISR_ISEM13		(1 << 13)
/** HSEM_MISR_ISEM12 masked interrupt(N) semaphore n status bit after enable (mask) **/
#define HSEM_MISR_ISEM12		(1 << 12)
/** HSEM_MISR_ISEM11 masked interrupt(N) semaphore n status bit after enable (mask) **/
#define HSEM_MISR_ISEM11		(1 << 11)
/** HSEM_MISR_ISEM10 masked interrupt(N) semaphore n status bit after enable (mask) **/
#define HSEM_MISR_ISEM10		(1 << 10)
/** HSEM_MISR_ISEM9 masked interrupt(N) semaphore n status bit after enable (mask) **/
#define HSEM_MISR_ISEM9		(1 << 9)
/** HSEM_MISR_ISEM8 masked interrupt(N) semaphore n status bit after enable (mask) **/
#define HSEM_MISR_ISEM8		(1 << 8)
/** HSEM_MISR_ISEM7 masked interrupt(N) semaphore n status bit after enable (mask) **/
#define HSEM_MISR_ISEM7		(1 << 7)
/** HSEM_MISR_ISEM6 masked interrupt(N) semaphore n status bit after enable (mask) **/
#define HSEM_MISR_ISEM6		(1 << 6)
/** HSEM_MISR_ISEM5 masked interrupt(N) semaphore n status bit after enable (mask) **/
#define HSEM_MISR_ISEM5		(1 << 5)
/** HSEM_MISR_ISEM4 masked interrupt(N) semaphore n status bit after enable (mask) **/
#define HSEM_MISR_ISEM4		(1 << 4)
/** HSEM_MISR_ISEM3 masked interrupt(N) semaphore n status bit after enable (mask) **/
#define HSEM_MISR_ISEM3		(1 << 3)
/** HSEM_MISR_ISEM2 masked interrupt(N) semaphore n status bit after enable (mask) **/
#define HSEM_MISR_ISEM2		(1 << 2)
/** HSEM_MISR_ISEM1 masked interrupt(N) semaphore n status bit after enable (mask) **/
#define HSEM_MISR_ISEM1		(1 << 1)
/** HSEM_MISR_ISEM0 masked interrupt(N) semaphore n status bit after enable (mask) **/
#define HSEM_MISR_ISEM0		(1 << 0)

/**@}*/

/** @defgroup hsem_cr CR HSEM Clear register
@{*/


#define HSEM_CR_KEY_SHIFT		16
#define HSEM_CR_KEY_MASK		0xffff
/** @defgroup hsem_cr_key KEY Semaphore clear Key
@{*/
/**@}*/


#define HSEM_CR_MASTERID_SHIFT		8
#define HSEM_CR_MASTERID_MASK		0xff
/** @defgroup hsem_cr_masterid MASTERID MasterID of semaphores to be cleared
@{*/
/**@}*/


/**@}*/

/** @defgroup hsem_keyr KEYR HSEM Interrupt clear register
@{*/


#define HSEM_KEYR_KEY_SHIFT		16
#define HSEM_KEYR_KEY_MASK		0xffff
/** @defgroup hsem_keyr_key KEY Semaphore Clear Key
@{*/
/**@}*/


/**@}*/
